БПКР/src/Enums/РазделыПерсонализированныхДанных/РазделыПерсонализированныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыПерсонализированныхДанных</name>
  <enumValues>
    <name>КоличествоКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>Сервис1СКонтрагентПодключен</name>
  </enumValues>
  <enumValues>
    <name>КоличествоСчетовНаОплату</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/РазделыПерсонализированныхДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив разделов монитора руководителя по умолчанию
// Возвращаемое значение:
// Массив - Список разделов монитора руководителя доступных по умолчанию
Функция РазделыПерсонализированныхДанныхПоУмолчанию() Экспорт
	
	РазделыПоУмолчанию = Новый Массив;
	РазделыПоУмолчанию.Добавить(КоличествоКонтрагентов);
	
	Возврат РазделыПоУмолчанию;
	
КонецФункции

// Возвращает массив разделов монитора руководителя по умолчанию
// Возвращаемое значение:
// Массив - Список разделов монитора руководителя доступных по умолчанию
Функция РазделыПерсонализированныхДанныхПодключенныеСервисы() Экспорт
	
	РазделыПодключенныеСервисы = Новый Массив;
	РазделыПодключенныеСервисы.Добавить(Сервис1СКонтрагентПодключен);
	
	Возврат РазделыПодключенныеСервисы;
	
КонецФункции

// Определяет перечень разделов, к данным которых у пользователя есть доступ.
// 
// Возвращаемое значение:
//  ФиксированныйМассив - содержит элементы перечисления
//
Функция РазрешенныеПользователюРазделыПерсонализированныхДанных() Экспорт
	
	РазрешенныеРазделы = Новый Массив;
	
	ПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь( , , Ложь);
	
	Для Каждого МетаданныеЗначения Из Метаданные.Перечисления.РазделыПерсонализированныхДанных.ЗначенияПеречисления Цикл
		
		Раздел = Перечисления.РазделыПерсонализированныхДанных[МетаданныеЗначения.Имя];
		
		Если Не ПолноправныйПользователь И Не ДанныеРазделаДоступны(Раздел) Тогда
			Продолжить;
		КонецЕсли;
		
		РазрешенныеРазделы.Добавить(Раздел);
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(РазрешенныеРазделы);
	
КонецФункции

// Проверяет достаточность прав пользователя для просмотра разделов персонализированных данных.
// Эти права определяются правами пользователя на просмотр исходных данных,
// на основании которых рассчитаны персонализированных данных.
//
// Может быть вызвана в привилегированном режиме.
//
// Параметры:
//  Раздел	 - ПеречислениеСсылка.РазделыПерсонализированныхДанных - раздел данных,
//             доступ к данным раздела которого проверяется
// 
// Возвращаемое значение:
//  Булево - Истина, если данные раздела доступны пользователю.
//
Функция ДанныеРазделаДоступны(Раздел) Экспорт
	
	// Может быть вызвана в привилегированном режиме.
	// В этом случае в ПравоДоступа() следует указывать параметр Пользователь.
	// Но может быть вызвана и вне привилегированного режима.
	// В этом случае параметр Пользователь указывать не следует.
	// Чтобы не делать две ветки, устанавливаем привилегированный режим.
	УстановитьПривилегированныйРежим(Истина);
	
	Если Раздел = КоличествоКонтрагентов Тогда
		
		Возврат ПравоДоступа(
			"Просмотр",
			Метаданные.Справочники.Контрагенты,
			ПользователиИнформационнойБазы.ТекущийПользователь());

	ИначеЕсли Раздел = Сервис1СКонтрагентПодключен Тогда
		
		Возврат ПравоДоступа(
			"Просмотр",
			Метаданные.Справочники.Контрагенты,
			ПользователиИнформационнойБазы.ТекущийПользователь());
			
	ИначеЕсли Раздел = КоличествоСчетовНаОплату Тогда
		
		Возврат ПравоДоступа(
			"Просмотр",
			Метаданные.Документы.СчетНаОплатуПокупателю,
			ПользователиИнформационнойБазы.ТекущийПользователь());
			
	Иначе
		
		Возврат ПравоДоступа(
			"Просмотр",
			Метаданные.ПланыСчетов.Хозрасчетный,
			ПользователиИнформационнойБазы.ТекущийПользователь());
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
